#include "urlEncode.hpp"

String urlEncode::urlEncode(String rusString) {
    // когда-нибудь я дореализую эту шнягу, но пока буду юзать инглиш
    // первый обязательно должон иметь перегруженный оператор меньше
    map <String, const char*> russianChars = {
        { "а", "%D0%B0" },
        { "б", "%D0%B1" }, 
        { "в", "%D0%B2" },
        { "г", "%D0%B3" },
        { "д", "%D0%B4" },
        { "е", "%D0%B5" }, 
        { "ё", "%D1%91" }, //искл
        { "ж", "%D0%B6" },
        { "з", "%D0%B7" },
        { "и", "%D0%B8" }, 
        { "й", "%D0%B9" },
        { "к", "%D0%BA" },
        { "л", "%D0%BB" },
        { "м", "%D0%BC" }, 
        { "н", "%D0%BD" },
        { "п", "%D0%BF" }
        { "р", "%D1%80" }, //+1
        { "с", "%D1%81" }, 
        { "т", "%D1%82" },
        { "у", "%D1%83" },
        { "ф", "%D1%84" },
        { "х", "%D1%85" }, 
        { "ц", "%D1%86" },
        { "ч", "%D1%87" },
        { "ш", "%D1%88" },
        { "щ", "%D1%89" }, 
        { "ъ", "%D1%8A" },
        { "ы", "%D1%8B" },
        { "ь", "%D1%8C" },
        { "э", "%D1%8D" }, 
        { "ю", "%D1%8E" },
        { "я", "%D1%8F" },
        { "А", "%D0%90" },
        { "Б", "%D0%91" }, 
        { "В", "%D0%92" },
        { "Г", "%D0%93" },
        { "Д", "%D0%94" },
        { "Е", "%D0%95" }, 
        { "Ё", "%D0%81" }, //искл
        { "Ж", "%D0%96" },
        { "З", "%D0%97" },
        { "И", "%D0%98" }, 
        { "Й", "%D0%99" },
        { "К", "%D0%9A" },
        { "Л", "%D0%9B" },
        { "М", "%D0%9C" }, 
        { "Н", "%D0%9D" },
        { "П", "%D0%9F" }
        { "Р", "%D0%A0" },
        { "С", "%D0%A1" }, 
        { "Т", "%D0%A2" },
        { "У", "%D0%A3" },
        { "Ф", "%D0%A4" },
        { "Х", "%D0%A5" }, 
        { "Ц", "%D0%A6" },
        { "Ч", "%D0%A7" },
        { "Ш", "%D0%A8" },
        { "Щ", "%D0%A9" }, 
        { "Ъ", "%D0%AA" },
        { "Ы", "%D0%AB" },
        { "Ь", "%D0%AC" },
        { "Э", "%D0%AD" }, 
        { "Ю", "%D0%AE" },
        { "Я", "%D0%AF" }
    };

    String res = "";

    for(int i = 0; i < rusString.length(); i++) {
        auto itOnRusChar = russianChars.find(rusString[i])
        if (itOnRusChar == russianChars.end()) {
            res += rusString[i]; // не преобразовываем
        } else {
            res += itOnRusChar->second; // пушим в новом виде
        }
    }

    return res;
}
